{
    "Office Phone": "250.980.1400",
    "Website": "www.interiorhealth.ca\/",
    "Additional Info": "www.interiorhealth.ca\/YourCare\/HomeCommunityCare\/AdultDayServices\/Pages\/default.aspx",
    "Primary Contact": "Kara Cooper, Coordinator of Adult Day Services & Volunteers; Phone: 250.980.1560; Email: kara.cooper@interiorhealth.ca",
    "Volunteer Coordinator": "Katie Durk, Activity\/Volunteer Coordinator, Interior Health; Phone: 250.980.1558",
    "Social Media": "Facebook: www.facebook.com\/InteriorHealthLinkedIn: www.linkedin.com\/company\/interior-health-authorityTwitter: twitter.com\/Interior_HealthYouTube: www.youtube.com\/user\/InteriorHealthAuth",
    "Service Details": "Offers supportive community programs for people at risk of losing their independence.  Services are designed to help  individuals to remain at home while supporting caregivers by providing a range of health, personal, social and recreational services in a safe and caring environment. While there are some variation in the services provided in Adult Day Services across Interior Health depending upon location, some examples include: - Health care such as health monitoring and giving medications- Assistance with personal care such as bathing programs- Health education- Therapeutic social programs and recreational programs such as discussion and exercise groups",
    "Hours": "9:30am - 3:00pm",
    "Dates": "Monday to Saturday depending on the site.",
    "Eligibility": "Ages: 19 year(s) and up- Have lived in British Columbia for three months - Be a Canadian citizen or have permanent resident status (be a landed immigrant or are on a Minister’s permit approved by the Ministry of Health Services) - Be unable to function independently because of chronic, health-related problems or have been diagnosed by a doctor with an end-stage illness",
    "How to Apply": "250.980.1400",
    "Cost": "Program ; A user fee of up to $10.00 per day will be charged to cover costs for supplies and meals.",
    "Address & Map": "2180 Ethel StKelowna, BC     V1Y 3A1View MapQuest Map",
    "Located In Community": "Central Okanagan",
    "Major Intersection": "Ethel St and Glenwood Ave",
    "Languages": "English",
    "Coordinates": [
        "49.8746760",
        "-119.4834650"
    ]
}