{
    "E-Mail": "moveforward@launchkelowna.ca",
    "Website": "www.launchkelowna.ca",
    "CanadaHelps Donation Page": "www.canadahelps.org\/en\/charities\/launchkelowna\/",
    "Primary Contact": "Michelle Dickie, Chief Engagement Officer, Launch Kelowna; Phone: 778.363.4959; Email: michelle@launchkelowna.ca",
    "Alternate Contact": "Abbie Norrish, Chief Financial Officer, Launch Kelowna; Phone: 778.363.4954; Email: abbie@launchkelowna.ca",
    "Volunteer Coordinator": "Michelle Dickie",
    "Social Media": "Facebook: www.facebook.com\/Launch-Kelowna-861503360596414",
    "Service Details": "Financial empowerment changes lives and builds futuresLaunch Community Development Foundation (Launch Kelowna) helps people move forward in life by providing them with the financial knowledge, confidence and community support to take the next step towards greater independence and sustainable positive change. Our programs increase participants’ understanding of their personal finances while also helping them to save their money, start a business, embark on post-secondary education or increase their skills in a trade. By providing people with a hand up – not a handout – we aim to strengthen the independence and resiliency of our participants.Dollars and Sense Program: FREE 7-week to gain a better understanding of everyday financial matters, focusing on topics such as budgeting, spending, and debt management.Matched Savings Program: program designed to teach participants how to effectively manage their personal finances, while providing the opportunity to save money towards continuing education, starting a small business and more. The program is designed to teach participants how to effectively manage their personal finances, while providing the opportunity to save money towards continuing education, starting a small business and more.Primer for Life: Do you have a son or daughter heading off to university, college or simply leaving home? If so, then you’ll want to read on! These five 1 hour sessions will help prepare your young adult to manage their finances when living on their own. There are no financial or income restrictions – everyone is welcome.",
    "Upcoming Events": "Matched Savings Program: 13 Sep 2018 to 05 Sep 2019",
    "Eligibility": "Ages: 18 year(s) and up",
    "How to Apply": "https:\/\/launchkelowna.ca\/sign-upmichelle@launchkelowna.ca",
    "Cost": "Free",
    "Located In Community": "Kelowna",
    "Languages": "English",
    "Former Name": "Metro UP Financial Asset & Literacy Foundation"
}