{
    "Office Phone": "250.762.4915",
    "Fax": "250.763.4488",
    "E-Mail": "em@pathwayskelowna.ca",
    "Website": "www.pathwayskelowna.ca\/",
    "CanadaHelps Donation Page": "www.canadahelps.org\/en\/charities\/pathways-abilities-society\/",
    "Primary Contact": "Bonnie Fraser, Employment Manager; Phone: 250.763.4839; Email: em@pathwayskelowna.ca",
    "Alternate Contact": "Charisse Daley, Executive Director; Phone: 250.763.4837; Email: ed@pathwayskelowna.ca",
    "Social Media": "Facebook: www.facebook.com\/KelownaPathways",
    "Service Details": "- Provides employment opportunities for individuals with disabilities (diverse-abilities) though Integrated Career Opportunities (ICO) and Social Ventures- Works in partnership with community employers- Sells refurbished bikes and manages the Lost and Found Bike Program for the City of KelownaIntegrated Career Opportunities (ICO):  - Provides opportunities for paid work by providing employment support to find, secure and maintain employment- Offers assessments, education, planning, skill development, support, on-site training, job coaching, development of natural supports, monitoring, follow up and the retention required to find and maintain long term employmentSocial Ventures:  - Provides employment opportunities for individuals who have barriers to employment, with individuals working under the supervision and support of the Society for part of or their entire shift- Contracts with community employers- Services are provided typically in a group and specifically develop knowledge and skills in communication and employment- Supports individuals who require supervision for health and safety reasons and\/or require supervision for issues that may jeopardize the health and safety of others in the work environment or who may not be able to complete all tasks and require a staff to carryout vital roles in order that the work can be completed",
    "Hours": "Please call first as hours vary depending on the time of year.",
    "How to Apply": "The following will be considered: amount of staff support required, emotional support required, physical support required and the amount of money available to provide the required supports.  Before a person can start receiving service from Pathways they must complete and give Pathways the following (required information): - A referral from the funding body, with confirmation from the funding body of their agreement of the placement. - Application for Service (completed with Pathways staff). - Consent and Community Support form. - Health and\/or Support Protocols.  After receiving the information, a Discovery is scheduled to helps Pathways gain a better understanding of who the person is and the type of service and\/or support they want, need and expect from Pathways.  Persons who apply with pre-existing funding receive priority for placement.  Persons wanting to attend Pathways services with their own support worker and who do not receive service from Pathways can do so based on the following:  - Individuals not attending school can attend for a two week period at no charge. Persons wanting to continue are charged a $5.00 per day attendance fee. - Students attending for practicum experience or transitional reasons can do so at no charge for the predetermined period. - Any person can attend the scheduled Social Recreation Evening and Weekend Service activities with their support worker at no charge. After beginning service, a person can request an increase in service or transfer to other Pathways service areas through a CLBC Facilitator.",
    "Address & Map": "1216 St Paul StKelowna, BC     V1Y 2C8View MapQuest Map",
    "Located In Community": "Kelowna",
    "Major Intersection": "Fuller Ave and Bertram St",
    "Languages": "English",
    "Former Name": "Kelowna & District Society for Community Living (KDSCL) ; Kelowna Diversified Industries (Kelowna & District Society for Community Living)",
    "Coordinates": [
        "49.8932870",
        "-119.4924010"
    ]
}