{
    "Office Phone": "250.469.8759",
    "E-Mail": "recreationandculture@kelowna.ca",
    "Website": "www.kelowna.ca\/parks-recreation\/programs-registration\/access-pass",
    "Additional Info": "www.kelowna.ca\/parks-recreation\/programs-registration",
    "Alternate Contact": "Wendy Serko, Recreation Program Assistant; Phone: 250.469.8954; Email: wserko@kelowna.ca",
    "Volunteer Coordinator": "Heather Crawford, Recreation Technician and Volunteer Coordinator; Phone: 250.469.8467; Email: hcrawford@kelowna.ca",
    "Social Media": "Facebook: www.facebook.com\/cityofkelownaInstagram: www.instagram.com\/cityofkelowna\/LinkedIn: www.linkedin.com\/company\/city-of-kelownaRSS: www.kelowna.ca\/city-hall\/contact-us\/rss-feedsTwitter: www.twitter.com\/cityofkelownaYouTube: www.youtube.com\/user\/cityofkelowna",
    "Service Details": "- Provides discount recreation passes for persons with a permanent cognitive or physical disability- Not designed for persons who are in a short term rehabilitation program- Provides three types of passes:  Access Pass Combination, Access Pass - Program, Access Pass - Facility",
    "Eligibility": "To submit an application, you will require:A letter from pension provider stating name, phone number, mailing address, date of birth, and disability status. Pension providers include the Federal or Provincial Government, WCB, ICBC, or a private insurance company. Partial disability pensions and pension applications in process will not be considered.ORA referral letter from an established agency, association or group home whose mandate is to support persons with a permanent disability. The referral letter must state the person’s name, phone number, mailing address, date of birth, and disability status. Referral letters from physicians and other medical professionals will not be accepted. ANDThe approval of the Community Recreation Coordinator.",
    "Address & Map": "1800 Parkinson WayKelowna, BC     V1Y 4P9View MapQuest Map",
    "Located In Community": "Kelowna",
    "Major Intersection": "Hwy 97 and Spall Rd",
    "Accessibility": "Fully Accessible ; Accessible by public transit, access friendly facility, wheel chair accessible, disabled parking, automatic doors, access friendly washrooms, hydraulic pool lift for main pool, ramp entry to small pool, access friendly fitness centre",
    "Languages": "English",
    "Former Name": "Recreation, Parks and Cultural Services, Active Communities",
    "Coordinates": [
        "49.8840000",
        "-119.4590000"
    ]
}