{
    "Office Phone": "1.866.866.0800",
    "Fax": "Kelowna office: 1.855.771.8792",
    "Website": "https:\/\/www2.gov.bc.ca\/gov\/content\/family-social-supports\/income-assistance",
    "Alternate Contact": "Enquiry BC; Phone: For BC residents 1.800.663.7867 * For residents outside BC 1.604.660.2421",
    "Service Details": "- Assists British Columbians by helping them move from income assistance to sustainable employment, and by providing income assistance to those who are unable to fully participate in the workforce- Applicants are expected to take advantage of all other sources of income and assets before qualifying",
    "Hours": "Office Hours:  Mon-Fri: 9:00am - 12:00pm & 1:00pm - 4:00pm- Telephone services available during lunch period- Closed statutory holidays",
    "Eligibility": "Ages: 19 year(s) and upIf you are in need and have no other resources, you may be eligible for income assistance. This can help support your transition to employment.You may be eligible if you find yourself in any of these situations:- You’re out of work or not earning enough to meet your basic needs- You’re waiting for other sources of money to arrive- You can&#39;t work at all- You urgently need food, shelter or medical attentionThe ministry can only give available resources to people who meet eligibility criteria. You must look for and use all other sources of income and assets before you apply.",
    "How to Apply": "Please visit the BC Employment and Assistance website for full details on the application process or call 1.866.866.0800",
    "Address & Map": "1640 Dilworth Dr, #130Kelowna, BC     V1Y 7V3View MapQuest Map",
    "Located In Community": "Kelowna",
    "Major Intersection": "Dilworth Dr and Enterprise Way",
    "Languages": "English ; Translation Service available upon request",
    "Former Name": "Ministry of Employment & Income Assistance (24 Jun 2008) ; Ministry of Social Development & Social Innovation (24 September 2017)",
    "Coordinates": [
        "49.8848450",
        "-119.4389070"
    ]
}