{
    "Mailing Address": "PO Box 9035Stn Prov GovtVictoria, BC     V8W 9E3",
    "Toll Free Phone": "1.800.663.7100",
    "Fax": "1.250.952.1742",
    "E-Mail": "mspenquiries@hibc.gov.bc.ca",
    "Website": "www.health.gov.bc.ca\/insurance",
    "Additional Info": "www2.gov.bc.ca\/gov\/content\/health\/health-drug-coverage\/msp\/bc-residents\/eligibility-and-enrolment\/how-to-enrol",
    "Service Details": "- Insures medically-required services provided by physicians and supplementary health care practitioners, laboratory services and diagnostic procedures- All residents of BC are required to enroll- For complete information on eligibility, please visit the MSP website- If you are a BC resident enrolled with MSP, you are eligible for a BC Services Card that combines your Driver&#39;s Licence and existing MSP cards into one card- To apply for a BC services card, please visit ICBC (in Kelowna located on Springfield Rd)",
    "Eligibility": "An individual must be a resident of BC:- is a citizen of Canada or is lawfully admitted to Canada for permanent residence,- makes his or her home in BC, and- is physically present in BC for        - at least six months in a calendar year, or        - a shorter prescribed period*,and includes those who are deemed under the regulations to be residents but do not include a tourist or visitor to BC.*Note: Effective 2013\/Jan\/01, eligible BC residents (citizens of Canada or persons who are lawfully admitted to Canada for permanent residence) who are outside BC for vacation purposes only, are allowed a total absence of up to seven months in a calendar year.Certain other individuals, such as some holders of study and\/or work permits, or working permits on working holiday programs-which are issued under the federal Immigration and Refugee Protection Act and are valid for a period of six or more months-may be deemed residents. Tourists or visitors to BC do not qualify.A spouse or a child of an eligible BC resident may also be deemed a resident provided that an application for permanent residence status has been accepted for processing by Citizenship and Immigration Canada (CIC), and the application remains active. Please visit our website for complete details.Dependent-includes a spouse and children who are deemed to be a resident.Spouse-a resident who is either married to or is living and cohabiting in a marriage-like relationship with the applicant (may be of the same gender).  (Note: in the case of divorce, the former spouse is no longer eligible for coverage as a dependent and must apply for separate coverage.)Child-a resident who is the legal ward or child of the applicant, is supported by the applicant, is neither married nor living and cohabiting in a marriage-like relationship, and is either age 18 or younger or age 19-24 and attending school or university full-time.",
    "Cost": "Fee assistance available.",
    "Address & Map": "1515 Blanshard StVictoria, BC     V8W 3C8View MapQuest Map",
    "Located In Community": "British Columbia",
    "Languages": "English ; French"
}