{
    "Office Phone": "250.868.2132",
    "Fax": "250.868.2173",
    "E-Mail": "info@cfdcco.bc.ca",
    "Website": "www.cfdcco.bc.ca",
    "Additional Info": "www.cfdcco.bc.ca\/services\/business-lending",
    "Social Media": "Facebook: www.facebook.com\/communityfuturescentralokanagan\/Twitter: twitter.com\/CFDCCO",
    "Service Details": "- Offers loans to businesses for start-up or expansion- Provides an alternate source of funding to businesses for start-up, expansion or business purchase- Term financing up to 5 years to a maximum of $150,000 is available to qualified applicants is available from the General Loan Fund, Youth Loan Fund (ages 18-29), Community Business Loan Fund, and Entrepreneurs with Disabilities Fund",
    "Hours": "Mon-Wed: 8:30am - 4:30pmThu: 9:30am - 4:30pmFri: 8:30am - 4:30pm",
    "Eligibility": "- Applicants must be residents of the Central Okanagan (Oyama to Peachland).- The business must operate and continue to operate during the term of the loan in the Central Okanagan. Applicants must not be in a position to access traditional sources of financing.- All loans are repayable in full. If your loan is approved you will meet with staff to arrange security requirements and the terms and conditions of your loan.- Community Futures is an alternative source of business capital offered at 9%. The interest rate is a set rate for the full term of the loan. Processing fees of 2% of the total amount will be applied (minimum of $350.00) upon approval and draw down of funds.- Life Insurance coverage is mandatory for loans exceeding $25,000, exclusive of fees.",
    "How to Apply": "Call for appointment or attend an Information Session",
    "Address & Map": "1726 Dolphin Ave, #210Kelowna, BC     V1Y 9R9View MapQuest Map",
    "Located In Community": "Kelowna",
    "Major Intersection": "Dolphin Ave and Kirschner Rd",
    "Accessibility": "Accessible by elevator",
    "Languages": "English",
    "Established": "1990",
    "Coordinates": [
        "49.8796230",
        "-119.4588000"
    ]
}