{
    "Mailing Address": "c\/o Director of Community Living Services1440 St. Paul StKelowna, BCV1Y 2E6",
    "Office Phone": "250.300.7814",
    "Fax": "250.763.1483",
    "E-Mail": "elliot.penner@jhscso.bc.ca",
    "Website": "www.johnhowardbc.ca\/regions\/cso\/welcome\/",
    "Additional Info": "ww.johnhowardbc.ca\/regions\/cso\/services\/cls\/outreach\/",
    "CanadaHelps Donation Page": "www.canadahelps.org\/en\/charities\/the-john-howard-society-central-and-south-okanagan\/",
    "Primary Contact": "Elliot Penner, Director of Community Living Services, The John Howard Society of the Central & South Okanagan; Phone: 250.300.7814; Email: elliot.penner@jhscso.bc.ca",
    "Alternate Contact": "Amanda Mason, Quality Service Lead, The John Howard Society of the Central & South Okanagan; Phone: 250.317.7693; Email: amanda.mason@jhscso.bc.ca",
    "Primary Executive": "Gaelene Askeland, Executive Director, The John Howard Society of the Central and South Okanagan; Phone: 250.763.1331; Email: gaelene.askeland@jhscso.bc.ca",
    "Social Media": "Facebook: www.facebook.com\/jhscso\/Twitter: twitter.com\/johnhowardbc",
    "Service Details": "Outreach + Community Inclusion  are part of our community living supports, that includes skill development and community\/home-based support, that assist adults with neurodevelopmental disabilities who are either involved in the criminal justice system or at-risk of being criminalizedSome of the main ways our services can help are: - Meeting one-on-one on a frequent and regular basis- Assistance with activities of daily living (ADL) and promoting independent living skills- Assistance with therapeutic recreational activities- Support acquiring and maintaining housing- Assistance with finding employment and occupational pursuits- Assisting with legal conditions and orders- Connecting to pertinent resources such as mental health, treatment, and others",
    "Hours": "As needed",
    "Eligibility": "Those interested in accessing this program must contact Community Living British Columbia (CLBC) to determine eligibility for the program and request service. CLBC will then coordinate service.",
    "Cost": "None",
    "Address & Map": "1440 St. Paul St NKelowna, BC     V1Y 2E6",
    "Located In Community": "Kelowna",
    "Accessibility": "Fully Accessible",
    "Languages": "English",
    "Former Name": "Gateway Mentoring & Outreach Program",
    "Coordinates": [
        "49.8877790",
        "-119.4920690"
    ]
}