{
    "Office Phone": "778.478.0244",
    "Fax": "778.478.0644",
    "E-Mail": "willowbridge@cmha.bc.ca",
    "Website": "cmhakelowna.com\/housing",
    "Primary Contact": "Ana Frias, Operations Coordinator; Email: ana.frias@cmha.bc.ca",
    "Volunteer Coordinator": "Denise Scott, Volunteer and Event Coordinator; Email: denise.scott@cmha.bc.ca",
    "Primary Executive": "Shelagh Turner, Executive Director; Email: shelagh.turner@cmha.bc.ca",
    "Social Media": "Facebook: www.facebook.com\/cmhakelownaFlickr: www.flickr.com\/photos\/cmhakelowna\/LinkedIn: www.linkedin.com\/company\/canadian-mental-health-associationPinterest: pinterest.com\/cmhakelowna\/Twitter: twitter.com\/cmhakelownaYouTube: www.youtube.com\/cmhakelowna",
    "Service Details": "- Provides supported, transitional housing for individuals who are homeless or at-risk of homelessness- Willowbridge participants receive support in developing the skills necessary to address mental health and substance use issues, brain injury, physical health problems, and income related issues- The building was designed to provide a welcoming and inclusive space that facilitates community and peer support- Our team aims to connect participants with community services, assist with goal-setting and life-skills development and encourage the development of healthy interpersonal relationships - Willowbridge program participants will be better equipped to secure stable and permanent housing, and develop and strengthen their skills and connections to set them up for ongoing success",
    "Hours": "Office Hours: Mon-Fri: 9:00am - 4:00pm (program hours vary)",
    "Eligibility": "Ages: 19 year(s) and upA referral from a community service provider, agency or organization is required to be considered for the Willowbridge program. We are not able to accept self-referrals.  A waiting list is not maintained.",
    "How to Apply": "To enquire about vacancies, or for more information, please contact Sheila Adams, Administration, 778.478.0244.After phone call confirming vacancy and program fit, your client can be referred by downloading and submitting the completed referral package (available on our website).",
    "Address & Map": "330 Boyce CresKelowna, BC     V1Y 5Z6",
    "Located In Community": "Kelowna",
    "Major Intersection": "Boyce Cres and Pandosy St",
    "Accessibility": "Fully Accessible",
    "Languages": "English",
    "Coordinates": [
        "49.8826570",
        "-119.4961590"
    ]
}