{
    "Mailing Address": "6741 Cariboo Rd, St 206Vancouver, BC     V3N 4A3",
    "Office Phone": "1.604.294.6886",
    "Toll Free Phone": "1.877.250.9936",
    "Website": "www.reusetechbc.ca\/",
    "Additional Info": "www.cfsc-opec.org\/",
    "CanadaHelps Donation Page": "www.canadahelps.org\/en\/charities\/british-columbia-technology-for-learning-society\/",
    "Social Media": "Facebook: www.facebook.com\/reusetechbc\/LinkedIn: www.linkedin.com\/company\/834173\/Twitter: twitter.com\/ReuseTechBC",
    "Service Details": "- Offers qualified low-income learners the opportunity to purchase donated computers at significantly reduced prices - Strives to provide families with the tools that will enable them to achieve their highest potential in the global knowledge-based economy",
    "Eligibility": "Computers for Students Eligibility:\tIn order to qualify for the Low Income Program, applicants must meet the following criteria:- Must be a resident of British Columbia- Must meet current Low Income Cut-off (LICO) standards- Must be enrolled in a skills development, learning or academic program* ​Please note that applications being submitted for anyone under the age of 18 require a parent or legal guardian to provide both proof of income and registration in an academic or skills training program * \tLow-income Cut-off Standards:\tLow income status is determined using the Low Income Cut-Off (LICO) Standards as defined by Statistics Canada. Visit http:\/\/www.statcan.gc.ca\/pub\/75f0002m\/2009002\/tbl\/tbl-3-eng.htm to view or download the “Pre-tax Measure” and http:\/\/www.statcan.gc.ca\/pub\/75f0002m\/2009002\/tbl\/tbl-2-eng.htm to view or download the “Post-tax Measure” LICO Standards to verify the current Low Income Cut-Offs.  * Please note that we use the most current information available to determine eligibility *\tProof of Income acceptable forms: \t- Most recent proof of financial assistance from B.C. Employment and Assistance for Persons with Disabilities Act- Most recent proof of financial assistance from Employment Insurance in the form of a benefit statement- Current Notice of Assessment prepared by Revenue CanadaPrograms & Enrollment Proof of Enrollment Acceptable Forms: - Confirmation of enrollment* Please note that Student ID cards will only be accepted from high school students under the age of 18 * Examples of eligible programs include:- Students registered in elementary, secondary or post-secondary institutions- Courses offered through an accredited institution- Enrollment in a skills development, learning or academic program- Night school courses- ESL",
    "Cost": "​Fees include:- $50 for a desktop (with LCD) or - $100 for a laptopWarranties:The computers for 6 months from the date it is dispatched from their officePayments:- Equipment being shipped:  payment by certified cheque or credit card must be received prior to shipping- For pick up* from our Burnaby workshop applicant must bring the following:  proof of British Columbia residency including address (eg. Driver’s License), proof of Low Income Cut-off (eg. most current Notice of Assessment), and proof of verifiable enrollment in a skills development, learning or academic program (eg. Class Schedule)*Please note:  debit, credit or cash payments accepted when picking up",
    "Located In Community": "British Columbia"
}