{
    "Mailing Address": "c\/o Mission Creek Alliance Church",
    "Office Phone": "250.860.2427",
    "Fax": "250.860.4551",
    "E-Mail": "office@mcachurch.ca",
    "Website": "www.mcachurch.ca",
    "Additional Info": "www.mcachurch.ca\/news\/how-to-get-involved-in-create",
    "CanadaHelps Donation Page": "www.canadahelps.org\/en\/charities\/kelowna-alliance-church-of-the-christian-missionary-allian\/",
    "Primary Contact": "Taran Main, Founder and Facilitator, Create; Phone: 250.801.0215; Email: taranmain@hotmail.com",
    "Alternate Contact": "Christina Drescher, Co-Founder & Facilitator, Create; Phone: 604.290.5009; Email: christina.drescher@gmail.com",
    "Social Media": "Facebook: www.facebook.com\/MissionCreekAlliance",
    "Service Details": "- CREATE is a program that offers free recreational activities to everyone in the community with a focus on offering it to those experiencing homelessness, substance use disorders, mental health and other life circumstances- It is an opportunity for anyone in the community to get involved in something that they are passionate about with other people who share that interest- There is always a coffee bar with light snacks provided each week.Some examples of possible activities:- Arts and crafts - would have a volunteer leader either teaching or facilitating a table where participants get to be creative and CREATE a personal work of art that they can take home with them.- Live music - would have a volunteer leader either teach how to play or play with fellow musicians for fun or put together a song that they could perform to the other participants!- Sporting events - lead by volunteers, we would bring people together for some physical activity and fun in the MCA gym!- Board games and Cards - a table would have a volunteer leader who would bring board games and have a great time playing games!- Cooking classes hosted by participants or by volunteers.",
    "Hours": "Sun: 1:00pm - 3:00pm",
    "Eligibility": "Everyone and anyone is welcome to attend. We can organize personal tours of the facilities either during Create hours or during the week.",
    "How to Apply": "No application required.",
    "Cost": "Free",
    "Address & Map": "Mission Creek Alliance Church2091 Springfield RdKelowna, BCCanada     V1Y 7X1",
    "Located In Community": "Kelowna",
    "Major Intersection": "Springfield Road and Cooper Road",
    "Languages": "American Sign Language (ASL) - Taran and a few participants can communicate via ASL",
    "Print Material": "Posters and handouts"
}